app/controllers/ideas_controller.rb

SELECT * FROM "ideas" LIMIT 10 OFFSET 0
---
  def index
    @ideas = Idea.paginate(:per_page => 10, :page => params[:page])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)
---
  def show
    @idea = Idea.find(params[:id])

INSERT INTO "ideas" ("updated_at", "title", "description", "created_at") VALUES('2009-10-07 14:02:13', 'an idea', 'an idea', '2009-10-07 14:02:13')
---
  def create
    @idea = Idea.new(params[:idea])

    respond_to do |format|
      if @idea.save